package pkg;

public class Main {

	public static void main(String[] args) {

		/*
		 * 6월 12일(월) ~ 6월 18일(일) 회고록
		 * 
		 * 이번 주는 계속 프로젝트 하느라 시간이 술술 지나간 것 같다.
		 * 하다가 문득 정신을 차리면 벌써 쉬는시간이고 하다보니
		 * 시간이 정말 잘 간다.
		 * 
		 * 이번주는 웹소켓을 이용한 관리자와 고객 간의 채팅을 구현하고 있다.
		 * 어찌보면 메일, 쪽지 형식이 맞겠지만, 웹소켓을 사용해보고 싶었기 때문에
		 * 어거지로 기능을 구현하고 있다. 뭐~ 기능을 구현했다는 사실이 더 중요하니까!
		 * 열심히 해보겠다.
		 * 
		 * 네트워크 관리사 2급 실기는 25일에 시험인데,
		 * 솔직하게 내가 지금 이 시험을 치룰 시간이 없는 것 같다.
		 * 하여 다음에 시험을 치룰 예정이다.
		 * 
		 * 이번 주 어려웠던 기능 구현은 jsp에 있는 체크박스 값을 ajax로 가져와
		 * 자바에서 DB에 있는 값을 업데이트 하여 jsp로 가져다주는 기능이 어려웠다.
		 * 
		 * 사실 내가 처음에 form 세팅을 잘못해서 오래 걸린 문제였다.
		 * 나는 당연히 jsp에서 체크박스 값을 바로 자바로 가져오게 할 수 있을 줄 알았는데
		 * ajax에서 받아 자바로 전달해줘야한다는 선생님의 말씀을 듣고 한대 맞은 것 같은 기분이었다.
		 * 
		 * 근데 button을 누르면 함수 실행해서 ajax로 가야하는데
		 * 내가 거기에 form을 초기에 세팅해놨어서 구현이 되지 않았던 문제였다.
		 * 
		 * 이렇게 또 하나 배웠으니 이런 일이 발생했을 때는 jsp쪽도 확실히 보면서 해야곘다 생각했다.
		 * 
		 * 오늘도 기능 구현 열심히 해보자 정원아 화이팅!!!
		 * 
		 */
	}

}
